/* アルゴリズムとデータ構造B
   3I ○番 氏名 提出日：
   #2 構造体の復習 */

#include <stdio.h>
#include <string.h>

int main() {
    // 設問１：氏名(name)，身長(height)，体重(weight)を管理するための構造体を宣言

    // 設問２：構造体変数 a を宣言し，各メンバに "高専太郎", 174, 64.2 を代入

    printf("設問３：aを用いて「氏名：高専太郎，身長：174 cm 体重：64.2 kg」と出力\n");
    // 設問３：aを用いて「氏名：高専太郎，身長：174 cm 体重：64.2 kg」と出力

    printf("設問４：構造体ポインタ p を用いて，構造体変数 a の情報を設問３と同様に出力\n");
    // 設問４：構造体ポインタ p を用いて，構造体変数 a の情報を設問３と同様に出力

    /*
    設問５：struct body 型の構造体配列 b (要素数3) を宣言し，
    0番目の要素に "高専太郎", 174, 64.2
    1番目の要素に "高専次郎", 163, 58.1
    2番目の要素に "高専三郎", 168, 70.3
    を代入
    */

    printf("設問６：構造体配列の情報を設問３と同様に，for文を用いて出力\n");
    // 設問６：構造体配列の情報を設問３と同様に，for文を用いて出力
    int i;
    // for() {

    // }

    return 0;
}

/* 実行結果を以下に貼り付けて提出

*/
